MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32ZG28A110F1024GM48/mcu.h
/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                                      0U         /**< Index of port PA */
#define GPIO_PA_COUNT                                      11U        /**< Number of pins on port PA */
#define GPIO_PA_MASK                                       (0x07FFUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0                                       1U         /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1                                       1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                                       1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                                       1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                                       1U         /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5                                       1U         /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6                                       1U         /**< GPIO pin PA6 is present. */
#define GPIO_PA_PIN7                                       1U         /**< GPIO pin PA7 is present. */
#define GPIO_PA_PIN8                                       1U         /**< GPIO pin PA8 is present. */
#define GPIO_PA_PIN9                                       1U         /**< GPIO pin PA9 is present. */
#define GPIO_PA_PIN10                                      1U         /**< GPIO pin PA10 is present. */
#define GPIO_PB_INDEX                                      1U         /**< Index of port PB */
#define GPIO_PB_COUNT                                      4U         /**< Number of pins on port PB */
#define GPIO_PB_MASK                                       (0x000FUL) /**< Port PB pin mask */
#define GPIO_PB_PIN0                                       1U         /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1                                       1U         /**< GPIO pin PB1 is present. */
#define GPIO_PB_PIN2                                       1U         /**< GPIO pin PB2 is present. */
#define GPIO_PB_PIN3                                       1U         /**< GPIO pin PB3 is present. */
#define GPIO_PC_INDEX                                      2U         /**< Index of port PC */
#define GPIO_PC_COUNT                                      10U        /**< Number of pins on port PC */
#define GPIO_PC_MASK                                       (0x03FFUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                                       1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                                       1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                                       1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                                       1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                                       1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                                       1U         /**< GPIO pin PC5 is present. */
#define GPIO_PC_PIN6                                       1U         /**< GPIO pin PC6 is present. */
#define GPIO_PC_PIN7                                       1U         /**< GPIO pin PC7 is present. */
#define GPIO_PC_PIN8                                       1U         /**< GPIO pin PC8 is present. */
#define GPIO_PC_PIN9                                       1U         /**< GPIO pin PC9 is present. */
#define GPIO_PD_INDEX                                      3U         /**< Index of port PD */
#define GPIO_PD_COUNT                                      6U         /**< Number of pins on port PD */
#define GPIO_PD_MASK                                       (0x003FUL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                                       1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                                       1U         /**< GPIO pin PD1 is present. */
#define GPIO_PD_PIN2                                       1U         /**< GPIO pin PD2 is present. */
#define GPIO_PD_PIN3                                       1U         /**< GPIO pin PD3 is present. */
#define GPIO_PD_PIN4                                       1U         /**< GPIO pin PD4 is present. */
#define GPIO_PD_PIN5                                       1U         /**< GPIO pin PD5 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                                    GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                                     1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                                    GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                                     2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                                      GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                                       3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                                      GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                                       4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                                      GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                                       3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                                 GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                                  4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                               GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                                3U            /**< Pin of TRACEDATA0.*/
#define GPIO_TRACEDATA1_PORT                               GPIO_PA_INDEX /**< Port of TRACEDATA1.*/
#define GPIO_TRACEDATA1_PIN                                5U            /**< Pin of TRACEDATA1.*/
#define GPIO_TRACEDATA2_PORT                               GPIO_PA_INDEX /**< Port of TRACEDATA2.*/
#define GPIO_TRACEDATA2_PIN                                6U            /**< Pin of TRACEDATA2.*/
#define GPIO_TRACEDATA3_PORT                               GPIO_PA_INDEX /**< Port of TRACEDATA3.*/
#define GPIO_TRACEDATA3_PIN                                7U            /**< Pin of TRACEDATA3.*/
#define GPIO_EFP_INT_PORT                                  GPIO_PC_INDEX /**< Port of EFP_INT.*/
#define GPIO_EFP_INT_PIN                                   5U            /**< Pin of EFP_INT.*/
#define GPIO_EFP_TX_SCL_PORT                               GPIO_PC_INDEX /**< Port of EFP_TX_SCL.*/
#define GPIO_EFP_TX_SCL_PIN                                2U            /**< Pin of EFP_TX_SCL.*/
#define GPIO_EFP_TX_SDA_PORT                               GPIO_PC_INDEX /**< Port of EFP_TX_SDA.*/
#define GPIO_EFP_TX_SDA_PIN                                1U            /**< Pin of EFP_TX_SDA.*/
#define GPIO_EM4WU0_PORT                                   GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                                    5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU10_PORT                                  GPIO_PD_INDEX /**< Port of EM4WU10.*/
#define GPIO_EM4WU10_PIN                                   5U            /**< Pin of EM4WU10.*/
#define GPIO_EM4WU3_PORT                                   GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                                    1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU4_PORT                                   GPIO_PB_INDEX /**< Port of EM4WU4.*/
#define GPIO_EM4WU4_PIN                                    3U            /**< Pin of EM4WU4.*/
#define GPIO_EM4WU6_PORT                                   GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                                    0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                                   GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                                    5U            /**< Pin of EM4WU7.*/
#define GPIO_EM4WU8_PORT                                   GPIO_PC_INDEX /**< Port of EM4WU8.*/
#define GPIO_EM4WU8_PIN                                    7U            /**< Pin of EM4WU8.*/
#define GPIO_EM4WU9_PORT                                   GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN                                    2U            /**< Pin of EM4WU9.*/
#define GPIO_THMSW_EN_PORT                                 GPIO_PC_INDEX /**< Port of THMSW_EN.*/
#define GPIO_THMSW_EN_PIN                                  9U            /**< Pin of THMSW_EN.*/
#define GPIO_THMSW_EN_PRIMARY_PORT                         GPIO_PC_INDEX /**< Port of THMSW_EN_PRIMARY.*/
#define GPIO_THMSW_EN_PRIMARY_PIN                          11U           /**< Pin of THMSW_EN_PRIMARY.*/
#define GPIO_THMSW_HALFSWITCH_PORT                         GPIO_PC_INDEX /**< Port of THMSW_HALFSWITCH.*/
#define GPIO_THMSW_HALFSWITCH_PIN                          9U            /**< Pin of THMSW_HALFSWITCH.*/
#define GPIO_THMSW_HALFSWITCH_PRIMARY_PORT                 GPIO_PC_INDEX /**< Port of THMSW_HALFSWITCH_PRIMARY.*/
#define GPIO_THMSW_HALFSWITCH_PRIMARY_PIN                  11U           /**< Pin of THMSW_HALFSWITCH_PRIMARY.*/
#define IADC0_VREFP_PORT                                   GPIO_PA_INDEX /**< Port of VREFP.*/
#define IADC0_VREFP_PIN                                    0U            /**< Pin of VREFP.*/
#define LCD_COM0_PORT                                      GPIO_PD_INDEX /**< Port of COM0.*/
#define LCD_COM0_PIN                                       2U            /**< Pin of COM0.*/
#define LCD_COM1_PORT                                      GPIO_PD_INDEX /**< Port of COM1.*/
#define LCD_COM1_PIN                                       3U            /**< Pin of COM1.*/
#define LCD_COM2_PORT                                      GPIO_PD_INDEX /**< Port of COM2.*/
#define LCD_COM2_PIN                                       4U            /**< Pin of COM2.*/
#define LCD_COM3_PORT                                      GPIO_PD_INDEX /**< Port of COM3.*/
#define LCD_COM3_PIN                                       5U            /**< Pin of COM3.*/
#define LCD_LCD_CP_PORT                                    GPIO_PA_INDEX /**< Port of LCD_CP.*/
#define LCD_LCD_CP_PIN                                     6U            /**< Pin of LCD_CP.*/
#define LCD_SEG0_PORT                                      GPIO_PC_INDEX /**< Port of SEG0.*/
#define LCD_SEG0_PIN                                       0U            /**< Pin of SEG0.*/
#define LCD_SEG1_PORT                                      GPIO_PC_INDEX /**< Port of SEG1.*/
#define LCD_SEG1_PIN                                       1U            /**< Pin of SEG1.*/
#define LCD_SEG10_PORT                                     GPIO_PA_INDEX /**< Port of SEG10.*/
#define LCD_SEG10_PIN                                      4U            /**< Pin of SEG10.*/
#define LCD_SEG11_PORT                                     GPIO_PA_INDEX /**< Port of SEG11.*/
#define LCD_SEG11_PIN                                      5U            /**< Pin of SEG11.*/
#define LCD_SEG12_PORT                                     GPIO_PA_INDEX /**< Port of SEG12.*/
#define LCD_SEG12_PIN                                      7U            /**< Pin of SEG12.*/
#define LCD_SEG13_PORT                                     GPIO_PA_INDEX /**< Port of SEG13.*/
#define LCD_SEG13_PIN                                      8U            /**< Pin of SEG13.*/
#define LCD_SEG14_PORT                                     GPIO_PB_INDEX /**< Port of SEG14.*/
#define LCD_SEG14_PIN                                      0U            /**< Pin of SEG14.*/
#define LCD_SEG15_PORT                                     GPIO_PB_INDEX /**< Port of SEG15.*/
#define LCD_SEG15_PIN                                      1U            /**< Pin of SEG15.*/
#define LCD_SEG16_PORT                                     GPIO_PB_INDEX /**< Port of SEG16.*/
#define LCD_SEG16_PIN                                      2U            /**< Pin of SEG16.*/
#define LCD_SEG17_PORT                                     GPIO_PB_INDEX /**< Port of SEG17.*/
#define LCD_SEG17_PIN                                      3U            /**< Pin of SEG17.*/
#define LCD_SEG18_PORT                                     GPIO_PC_INDEX /**< Port of SEG18.*/
#define LCD_SEG18_PIN                                      8U            /**< Pin of SEG18.*/
#define LCD_SEG19_PORT                                     GPIO_PC_INDEX /**< Port of SEG19.*/
#define LCD_SEG19_PIN                                      9U            /**< Pin of SEG19.*/
#define LCD_SEG2_PORT                                      GPIO_PC_INDEX /**< Port of SEG2.*/
#define LCD_SEG2_PIN                                       2U            /**< Pin of SEG2.*/
#define LCD_SEG20_PORT                                     GPIO_PA_INDEX /**< Port of SEG20.*/
#define LCD_SEG20_PIN                                      9U            /**< Pin of SEG20.*/
#define LCD_SEG21_PORT                                     GPIO_PA_INDEX /**< Port of SEG21.*/
#define LCD_SEG21_PIN                                      10U           /**< Pin of SEG21.*/
#define LCD_SEG3_PORT                                      GPIO_PC_INDEX /**< Port of SEG3.*/
#define LCD_SEG3_PIN                                       3U            /**< Pin of SEG3.*/
#define LCD_SEG4_PORT                                      GPIO_PC_INDEX /**< Port of SEG4.*/
#define LCD_SEG4_PIN                                       4U            /**< Pin of SEG4.*/
#define LCD_SEG5_PORT                                      GPIO_PC_INDEX /**< Port of SEG5.*/
#define LCD_SEG5_PIN                                       5U            /**< Pin of SEG5.*/
#define LCD_SEG6_PORT                                      GPIO_PC_INDEX /**< Port of SEG6.*/
#define LCD_SEG6_PIN                                       6U            /**< Pin of SEG6.*/
#define LCD_SEG7_PORT                                      GPIO_PC_INDEX /**< Port of SEG7.*/
#define LCD_SEG7_PIN                                       7U            /**< Pin of SEG7.*/
#define LCD_SEG8_PORT                                      GPIO_PA_INDEX /**< Port of SEG8.*/
#define LCD_SEG8_PIN                                       0U            /**< Pin of SEG8.*/
#define LCD_SEG9_PORT                                      GPIO_PA_INDEX /**< Port of SEG9.*/
#define LCD_SEG9_PIN                                       1U            /**< Pin of SEG9.*/
#define LESENSE_EN_0_PORT                                  GPIO_PA_INDEX /**< Port of EN_0.*/
#define LESENSE_EN_0_PIN                                   3U            /**< Pin of EN_0.*/
#define LESENSE_EN_1_PORT                                  GPIO_PA_INDEX /**< Port of EN_1.*/
#define LESENSE_EN_1_PIN                                   4U            /**< Pin of EN_1.*/
#define LESENSE_EN_2_PORT                                  GPIO_PA_INDEX /**< Port of EN_2.*/
#define LESENSE_EN_2_PIN                                   5U            /**< Pin of EN_2.*/
#define LFXO_LFXTAL_I_PORT                                 GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                                  1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                                 GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                                  0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                                GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                                 1U            /**< Pin of LF_EXTCLK.*/
#define VDAC0_CH0_MAIN_OUT_PORT                            GPIO_PB_INDEX /**< Port of CH0_MAIN_OUT.*/
#define VDAC0_CH0_MAIN_OUT_PIN                             0U            /**< Pin of CH0_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PORT                            GPIO_PB_INDEX /**< Port of CH1_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PIN                             1U            /**< Pin of CH1_MAIN_OUT.*/

